Tekla.Structures.Model.ConicalSurface
The ConicalSurface class defines a conical surface contour.

Tekla.Structures.Model.ConicalSurface.Radiuses
Gets radiuses of the conical surface. The first radius corresponds to the section located in the first
point of the side boundary 1, and the second radius corresponds to the section located in the second point
of the side boundary 1.

Tekla.Structures.Model.ConicalSurface.Apex
Gets the apex of the cone. If it does not exist, it returns null

Tekla.Structures.Model.ConicalSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Initializes a new instance of the Tekla.Structures.Model.ConicalSurface class with given parameters.
The boundaries are defined by the side boundaries (i.e. generator lines of the cone).
Remarks: This constructor may be numerically instable if the end faces are very close
endFaceNormal1: The first end face normal.
endFaceNormal2: The second end face normal.
sideBoundary1: The first side boundary.
sideBoundary2: The second side boundary.
Throws System.ArgumentNullException: Throws exception if one of the arguments has null value.

Tekla.Structures.Model.ConicalSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point})
Initializes a new instance of the Tekla.Structures.Model.ConicalSurface class with given parameters.
The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the cone).
The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
Remarks: This constructor may be numerically instable if the end faces are very close
endFaceNormal1:  The first end face normal.
endFaceNormal2:  The second end face normal.
lateralBoundary1:  The first lateral boundary
lateralBoundary2:  The second lateral boundary
Throws System.ArgumentNullException:  Throws an exception if one of the arguments is null.
Throws System.ArgumentException:  Throws this exception if the boundaries are invalid.

Tekla.Structures.Model.ConicalSurface.#ctor(Tekla.Structures.Geometry3d.Arc,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.Model.ConicalSurface class from a base arc, a height and a radius at the top.
This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
baseArc: Arc to form the base of the bend surface
height: Height of the surface measured along the normal of the arc, may be positive or
negative, but always nonzero
radiusAtHeight: Radius of the arc located at the given height. Must be positive
Throws System.ArgumentException: Thrown if the given lengths are invalid

Tekla.Structures.Model.ConicalSurface.#ctor(System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.Vector)
Initializes a new instance of the Tekla.Structures.Model.ConicalSurface class from the cone lateral boundaries and the center line.
This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface.
lateralBoundary1: The first lateral boundary.
lateralBoundary2: The second lateral boundary
centerLine: The center line of the cone/cylinder
rotationAxis:
A vector normal to the circular cross sections of the cone. It defines the rotation axis from the
start of a lateral boundary to the end of the same lateral boundary, according to the right hand rule.